<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 中间件配置
// +----------------------------------------------------------------------
return [
    // 默认中间件命名空间
    'adminId' => 1, // 超级管理员id
    'groupId' => 1, // 超级管理员组id
    'syslog'=>[
        'max'         =>1000000,
        'begin'       => 0
    ],
    'code_key' => '',
    'store_name' => '',
    'max_import_excel_nums' => 100, // excel导入最大条数
    'question_types' => [
        'type1' => [
            'index' => 1,
            'name' => '问答题' // 原监督题
        ],
        'type2' => [
            'index' => 2,
            'name' => '记录题'
        ],
        'type3' => [
            'index' => 3,
            'name' => '选择题'
        ],
        'type4' => [
            'index' => 4,
            'name' => '填空题'
        ],
        'type5' => [
            'index' => 5,
            'name' => '判断题'
        ],
    ]
];
